[{"title": "Un ordinateur peut accéder aux périphériques situés sur le même réseau que lui, mais pas à ceux présents sur d’autres réseaux. Quelle est la cause probable de ce problème ?", "ans": "L’adresse de la passerelle par défaut de l’ordinateur n’est pas valide."}, {"title": "Quelle déclaration décrit une caractéristique du protocole IP ?", "ans": "IP s’appuie sur les services de la couche supérieure pour gérer les situations de paquets manquants ou hors de service."}, {"title": "Sur un réseau de production, quel est l’objectif de la configuration d’un commutateur avec une adresse de passerelle par défaut ?", "ans": "L’adresse de la passerelle par défaut est utilisée pour transférer les paquets provenant du commutateur vers des réseaux distants."}, {"title": "Quelle proposition est une caractéristique de base du protocole IP ?", "ans": "Sans connexion"}, {"title": "Quel avantage l’en-tête IPv6 simplifié présente-t-il par rapport à IPv4 ?", "ans": "Les paquets sont gérés plus efficacement."}, {"title": "Quel champ de l’en-tête IPv4 identifie le protocole de la couche supérieure transmis dans le paquet ?", "ans": "Protocole"}, {"title": "Quelles informations le test de bouclage fournit-il ?", "ans": "La pile TCP/IP sur le périphérique fonctionne correctement."}, {"title": "Comment les hôtes s’assurent-ils que leurs paquets sont dirigés vers la destination réseau appropriée ?", "ans": "Ils doivent conserver leur propre table de routage locale qui contient une route vers l’interface de bouclage, une route réseau locale et une route par défaut distante."}, {"title": "Quelle proposition décrit la fonction du protocole ARP (Address Resolution Protocol) ?", "ans": "Le protocole ARP permet de détecter l’adresse MAC de tout hôte sur le réseau local."}, {"title": "Dans quelles deux circonstances un commutateur peut-il inonder chaque port d’une trame, à l’exception de celui sur lequel la trame a été reçue ? (Choisissez deux propositions.)?", "ans": "L’adresse de destination est inconnue pour le commutateur."}, {"title": "Parmi les propositions suivantes, laquelle explique ce que font les demandes ARP sur une liaison locale ?", "ans": "La trame a comme adresse de destination l’adresse de diffusion."}, {"title": "Quelle adresse de destination est utilisée dans un cadre de requête ARP ?", "ans": "Elles sont réceptionnées et traitées par tous les périphériques situés sur le réseau local."}, {"title": "Un technicien réseau exécute une commande arp -d * sur un ordinateur après la reconfiguration du routeur connecté au réseau local. Quel est le résultat obtenu suite à l’exécution de cette commande ?", "ans": "FFFF.FFFF.FFFF"}, {"title": "Examinez l’illustration. L’illustration présente un réseau commuté de petite taille et le contenu de la table d’adresses MAC du commutateur. Le PC1 a envoyé une trame au PC3. Comment le commutateur traite-t-il cette trame ?", "ans": "Le cache ARP est vidé."}, {"title": "Quelles informations importantes sont examinées dans l’en-tête de la trame Ethernet par un périphérique de couche 2 avant de transmettre les données ?", "ans": "Le commutateur transfère la trame à tous les ports excepté au port 4."}, {"title": "Citez deux fonctions de la mémoire vive non volatile. (Choisissez deux propositions.)?", "ans": "Adresse MAC de destination"}, {"title": "Un routeur démarre et entre en mode de configuration. Pour quelle raison ?", "ans": "Conserver le fichier de configuration initiale"}, {"title": "Reportez-vous à l’illustration. Un PC d’utilisateur a réussi à transmettre des paquets à www.cisco.com. Quelle adresse IP le PC de l’utilisateur cible-t-il afin de transmettre ses données hors du réseau local ?", "ans": "Conserver le contenu en cas de panne de courant"}, {"title": "Quelles sont les trois commandes qui permettent de configurer un accès sécurisé à un routeur via une connexion à l’interface de console ? (Choisissez trois propositions.)?", "ans": "Le fichier de configuration est manquant dans NVRAM."}, {"title": "Examinez l’illustration. Examinez la configuration d’adresse IP indiquée à partir du PC1. Parmi les propositions suivante, laquelle correspond à une description de l’adresse de la passerelle par défaut ?", "ans": "172.20.0.254"}, {"title": "Quelles sont les deux fonctions principales d’un routeur? (Choisissez deux réponses.)?", "ans": "login"}, {"title": "Quel est l’effet de l’utilisation de la commande Router# copy running-config startup-config sur un routeur?", "ans": "password cisco"}, {"title": "Que se passe-t-il si l’adresse de la passerelle par défaut n’est pas correctement configurée sur un hôte ?", "ans": "line console 0"}, {"title": "Quels sont les problèmes réseau potentiels pouvant résulter du fonctionnement d’ARP ? (Choisissez deux réponses.)?", "ans": "Il s’agit de l’adresse IP de l’interface Router1 qui connecte le réseau local du PC1 au Router1."}, {"title": "Quel terme décrit un champ dans l’en-tête de paquet IPv4 qui contient une valeur binaire 4 bits définie sur 0100?", "ans": "Choix des chemins"}, {"title": "Quelle propriété d’ARP permet aux hôtes d’un réseau local d’envoyer du trafic vers des réseaux distant?", "ans": "Transmission de paquets"}, {"title": "Refer to the exhibit. Un administrateur réseau connecte un nouvel hôte au réseau local du Store. L’hôte doit communiquer avec les réseaux distants. Quelle adresse IP doit être configurée comme passerelle par défaut sur le nouvel hôte?", "ans": "Le contenu de la NVRAM changera."}, {"title": "Pourquoi la traduction d’adresses de réseau (NAT) n’est pas nécessaire dans IPv6 ?", "ans": "L’hôte ne peut pas communiquer avec les hôtes situés sur d’autres réseaux."}, {"title": "Quel paramètre le routeur utilise-t-il pour choisir le chemin vers la destination lorsque plusieurs routes sont disponibles ?", "ans": "Les attaques sur le réseau peuvent manipuler les mappages d’adresses MAC et IP dans les messages ARP pour intercepter le trafic réseau."}, {"title": "La couche réseau du modèle OSI fournit deux services. Lesquels ? (Choisissez deux propositions.)", "ans": "Sur les grands réseaux à faible bande passante, plusieurs diffusions ARP peuvent entraîner des délais de communication de données."}, {"title": "Quelle entrée de la table de routage comporte une adresse de tronçon suivant associée à un réseau de destination ?", "ans": "version"}, {"title": "Quels sont les deux types de messages IPv6 utilisés à la place de l’ARP pour la résolution d’adresse?", "ans": "L’adresse MAC de la passerelle par défaut"}, {"title": "Quel est le but d’une attaque par usurpation ARP ?", "ans": "172.19.98.230"}, {"title": "Examinez l’illustration. PC1 tente de se connecter à File_server1 et envoie une requête ARP pour obtenir une adresse MAC de destination. Quelle adresse MAC PC1 reçoit-il dans la réponse ARP ?", "ans": "N’importe quel hôte ou utilisateur peut obtenir une adresse réseau IPv6 publique car le nombre d’adresses IPv6 disponibles est très important."}, {"title": "Un nouvel administrateur de réseau a été invité à saisir un message de bannière sur un appareil Cisco. Quel est le moyen le plus rapide pour un administrateur de réseau de vérifier si la bannière est correctement configurée ?", "ans": "La valeur métrique la plus faible qui est associée au réseau de destination"}, {"title": "La commande de configuration globale ip default-gateway 172.16.100.1 est appliquée sur un commutateur. Quel est l’effet de cette commande?", "ans": "Encapsulation des PDU provenant de la couche transport"}, {"title": "Que se passe-t-il lorsque la commande transport input ssh est entrée sur les lignes vty du switch?", "ans": "Routage des paquets vers la destination"}, {"title": "Quel terme décrit un champ dans l’en-tête de paquet IPv4 utilisé pour identifier le protocole de niveau suivant?", "ans": "Les routes distantes"}, {"title": "Quelle propriété d’ARP fait que les cartes réseau recevant une demande ARP transmettent la partie données de la trame Ethernet au processus ARP?", "ans": "Sollicitation de voisin"}, {"title": "Refer to the exhibit. Un administrateur réseau connecte un nouvel hôte au réseau local Manager. L’hôte doit communiquer avec les réseaux distants. Quelle adresse IP doit être configurée comme passerelle par défaut sur le nouvel hôte?", "ans": "Annonce de voisin"}, {"title": "Refer to the exhibit. Un administrateur réseau est en train de connecter un nouvel hôte au réseau local du bureau d’enregistrement. L’hôte doit communiquer avec les réseaux distants. Quelle adresse IP doit être configurée comme passerelle par défaut sur le nouvel hôte ?", "ans": "Associer des adresses IP à des adresses MAC incorrectes"}, {"title": "Reliez les commandes au mode de configuration dans lequel on doit les saisir. (Les options ne sont pas toutes utilisées.)", "ans": "L’adresse MAC de l’interface G0/0 sur R1."}, {"title": "Lors du transport des données depuis des applications en temps réel, notamment la lecture audio et vidéo en continu, quel champ de l’en-tête IPv6 peut être utilisé pour informer les routeurs et les commutateurs de conserver le même chemin pour les paquets au sein de la même conversation ?", "ans": "Quittez le mode d’exécution privilégié et appuyez sur Enter ."}, {"title": "Quel champ de l’en-tête IPv4 permet d’empêcher un paquet de traverser un réseau indéfiniment ?", "ans": "Le commutateur peut être géré à distance à partir d’un hôte sur un autre réseau."}, {"title": "Refer to the exhibit.exposition. Un administrateur réseau connecte un nouvel hôte au réseau local du Store. L’hôte doit communiquer avec les réseaux distants. Quelle adresse IP doit être configurée comme passerelle par défaut sur le nouvel hôte?", "ans": "La communication entre le commutateur et les utilisateurs distants est cryptée."}, {"title": "Quelle propriété d’ARP permet de fixer les adresses MAC des serveurs fréquemment utilisés dans la table ARP?", "ans": "protocole"}, {"title": "Refer to the exhibit. Un administrateur réseau connecte un nouvel hôte au réseau local de Payroll. L’hôte doit communiquer avec les réseaux distants. Quelle adresse IP doit être configurée comme passerelle par défaut sur le nouvel hôte?", "ans": "Le champ de type 0x806 apparaît dans l’en-tête de la trame Ethernet."}, {"title": "Quel terme décrit un champ de l’en-tête de paquet IPv4 qui contient une adresse de monodiffusion, de multidiffusion ou de diffusion ?", "ans": "10.118.62.196"}, {"title": "Sur un ordinateur hôte, où sont enregistrés les mappages adresse IPv4-adresse Ethernet de couche 2 ?", "ans": "192.168.235.234"}, {"title": "Quel terme décrit un champ dans l’en-tête de paquet IPv4 qui contient une valeur binaire 32 bits associée à une interface sur le périphérique d’envoi?", "ans": "Étiquetage de flux"}, {"title": "Quelle propriété d’ARP fait que les mappages IP-Mac mis en cache restent en mémoire plus longtemps?", "ans": "Time To Live (durée de vie)"}, {"title": "Refer to the exhibit. Un administrateur réseau connecte un nouvel hôte au réseau local Medical. L’hôte doit communiquer avec les réseaux distants. Quelle adresse IP doit être configurée comme passerelle par défaut sur le nouvel hôte?", "ans": "172.20.132.13"}, {"title": "Quelle propriété d’ARP provoque l’inondation de la demande de tous les ports d’un commutateur à l’exception du port recevant la demande ARP?", "ans": "Une entrée d’adresse IP à Mac statique peut être saisie manuellement dans une table ARP."}]