[{"title": "Which information is used by routers to forward a data packet toward its destination?", "ans": "destination IP address*"}, {"title": "A computer has to send a packet to a destination host in the same LAN. How will the packet be sent?", "ans": "The packet will be sent directly to the destination host.*"}, {"title": "A router receives a packet from the Gigabit 0/0 interface and determines that the packet needs to be forwarded out the Gigabit 0/1 interface. What", "ans": "create a new Layer 2 Ethernet frame to be sent to the destination*"}, {"title": "Which IPv4 address can a host use to ping the loopback interface?", "ans": "127.0.0.1*"}, {"title": "A computer can access devices on the same network but cannot access devices on other networks. What is the probable cause of this problem?", "ans": "The computer has an invalid default gateway address.*"}, {"title": "Which statement describes a feature of the IP protocol?", "ans": "IP relies on upper layer services to handle situations of missing or out-of-order packets.*"}, {"title": "Why is NAT not needed in IPv6?​", "ans": "Explanation:"}, {"title": "Which parameter does the router use to choose the path to the destination when there are multiple routes available?", "ans": "Any host or user can get a public IPv6 network address because the number of available IPv6 addresses is extremely large.​*"}, {"title": "What are two services provided by the OSI network layer? (Choose two.)", "ans": "the lower metric value that is associated with the destination network*"}, {"title": "Within a production network, what is the purpose of configuring a switch with a default gateway address?", "ans": "routing packets toward the destination*"}, {"title": "What is a basic characteristic of the IP protocol?", "ans": "encapsulating PDUs from the transport layer*"}, {"title": "Which field in the IPv4 header is used to prevent a packet from traversing a network endlessly?", "ans": "Explanation:"}, {"title": "What is one advantage that the IPv6 simplified header offers over IPv4?", "ans": "The default gateway address is used to forward packets originating from the switch to remote networks.*"}, {"title": "What IPv4 header field identifies the upper layer protocol carried in the packet?", "ans": "Explanation:"}, {"title": "Refer to the exhibit. Match the packets with their destination IP address to the exiting interfaces on the router. (Not all targets are used.)", "ans": "Connectionless*"}, {"title": "What information does the loopback test provide?", "ans": "Explanation:"}, {"title": "What routing table entry has a next hop address associated with a destination network?", "ans": "Time-to-Live*"}, {"title": "How do hosts ensure that their packets are directed to the correct network destination?", "ans": "Explanation:"}, {"title": "When transporting data from real-time applications, such as streaming audio and video, which field in the IPv6 header can be used to inform the routers and switches to maintain the same path for the packets in the same conversation?", "ans": "efficient packet handling*"}, {"title": "What statement describes the function of the Address Resolution Protocol?", "ans": "Explanation:"}, {"title": "Under which two circumstances will a switch flood a frame out of every port except the port that the frame was received on? (Choose two.)", "ans": "Protocol*"}, {"title": "Which statement describes the treatment of ARP requests on the local link?", "ans": "Explanation:"}, {"title": "Which destination address is used in an ARP request frame?", "ans": "Explanation:"}, {"title": "A network technician issues the arp -d * command on a PC after the router that is connected to the LAN is reconfigured. What is the result after this command is issued?", "ans": "The TCP/IP stack on the device is working correctly.*"}, {"title": "Refer to the exhibit.", "ans": "remote routes*"}, {"title": "exhibit shows a small switched network and the contents of the MAC address table of the switch. PC1 has sent a frame addressed to PC3. What will the switch do with the frame?", "ans": "They have to keep their own local routing table that contains a route to the loopback interface, a local network route, and a remote default route.​*"}, {"title": "Which two types of IPv6 messages are used in place of ARP for address resolution?", "ans": "Flow Label*"}, {"title": "What is the aim of an ARP spoofing attack?", "ans": "Explanation:"}, {"title": "Refer to the exhibit.", "ans": "ARP is used to discover the MAC address of any host on the local network.*"}, {"title": "attempts to connect to File_server1 and sends an ARP request to obtain a destination MAC address. Which MAC address will PC1 receive in the ARP reply?", "ans": "The frame has the broadcast address as the destination address.*"}, {"title": "Where are IPv4 address to Layer 2 Ethernet address mappings maintained on a host computer?", "ans": "The destination address is unknown to the switch.*"}, {"title": "What important information is examined in the Ethernet frame header by a Layer 2 device in order to forward the data onward?", "ans": "Explanation:"}, {"title": "Match the commands to the correct actions. (Not all options are used.)", "ans": "They are received and processed by every device on the local network.*"}, {"title": "A new network administrator has been asked to enter a banner message on a Cisco device. What is the fastest way a network administrator could test whether the banner is properly configured?", "ans": "Explanation:"}, {"title": "A network administrator requires access to manage routers and switches locally and remotely. Match the description to the access method. (Not all options are used.)", "ans": "FFFF.FFFF.FFFF*"}, {"title": "Match the phases to the functions during the boot up process of a Cisco router. (Not all options are used.)", "ans": "Explanation:"}, {"title": "Match the command with the device mode at which the command is entered. (Not all options are used.)", "ans": "The ARP cache is cleared.*"}, {"title": "What are two functions of NVRAM? (Choose two.)", "ans": "Explanation:"}, {"title": "A router boots and enters setup mode. What is the reason for this?", "ans": "The switch will forward the frame to all ports except port 4.*"}, {"title": "The global configuration command ip default-gateway 172.16.100.1 is applied to a switch. What is the effect of this command?", "ans": "Explanation:"}, {"title": "What happens when the transport input ssh command is entered on the switch vty lines?", "ans": "neighbor solicitation*"}, {"title": "Refer to the exhibit.", "ans": "neighbor advertisement*"}, {"title": "user PC has successfully transmitted packets to www.cisco.com. Which IP address does the user PC target in order to forward its data off the local network?", "ans": "Explanation:"}, {"title": "Match the configuration mode with the command that is available in that mode. (Not all options are used.)", "ans": "to associate IP addresses to the wrong MAC address*"}, {"title": "Which three commands are used to set up secure access to a router through a connection to the console interface? (Choose three.)", "ans": "the MAC address of the G0/0 interface on R1*"}, {"title": "Refer to the exhibit.", "ans": "ARP cache*"}, {"title": "the IP address configuration shown from PC1. What is a description of the default gateway address?", "ans": "destination MAC address*"}, {"title": "Which two functions are primary functions of a router? (Choose two.)", "ans": "Explanation:"}, {"title": "What is the effect of using the Router# copy running-config startup-config command on a router?", "ans": "Exit privileged EXEC mode and press Enter.*"}, {"title": "What will happen if the default gateway address is incorrectly configured on a host?", "ans": "Explanation:"}, {"title": "What are two potential network problems that can result from ARP operation? (Choose two.)", "ans": "Explanation:"}, {"title": "Open the PT activity. Perform the tasks in the activity instructions and then ans the title.\nWhich interfaces in each router are active and operational?", "ans": "Explanation:"}, {"title": "Which term describes a field in the IPv4 packet header used to identify the next level protocol?", "ans": "Explanation:"}, {"title": "Which term describes a field in the IPv4 packet header that contains an 8-bit binary value used to determine the priority of each packet?", "ans": "to retain contents when power is removed*"}, {"title": "Which term describes a field in the IPv4 packet header that contains a 32-bit binary value associated with an interface on the sending device?", "ans": "to store the startup configuration file*"}, {"title": "Which term describes a field in the IPv4 packet header used to detect corruption in the IPv4 header?", "ans": "Explanation:"}, {"title": "", "ans": "The configuration file is missing from NVRAM.*"}, {"title": "to the exhibit. A network administrator is connecting a new host to the Payroll LAN. The host needs to communicate with remote networks. What IP address would be configured as the default gateway on the new host?", "ans": "The switch can be remotely managed from a host on another network.*"}, {"title": "Which term describes a field in the IPv4 packet header that contains a unicast, multicast, or broadcast address?", "ans": "Explanation:"}, {"title": "Which term describes a field in the IPv4 packet header used to limit the lifetime of a packet?", "ans": "Communication between the switch and remote users is encrypted.*"}, {"title": "Which term describes a field in the IPv4 packet header that contains a 4-bit binary value set to 0100?", "ans": "Explanation:"}, {"title": "Which term describes a field in the IPv4 packet header used to identify the next level protocol?", "ans": "172.20.0.254*"}, {"title": "Which term describes a field in the IPv4 packet header that contains a 4-bit binary value set to 0100?", "ans": "Explanation:"}, {"title": "What property of ARP causes cached IP-to-MAC mappings to remain in memory longer?", "ans": "line console 0*"}, {"title": "What property of ARP allows MAC addresses of frequently used servers to be fixed in the ARP table?", "ans": "login*"}, {"title": "What property of ARP allows MAC addresses of frequently used servers to be fixed in the ARP table?", "ans": "password cisco*"}, {"title": "What property of ARP allows hosts on a LAN to send traffic to remote networks?", "ans": "Explanation:"}, {"title": "", "ans": "It is the IP address of the Router1 interface that connects the PC1 LAN to Router1.*"}, {"title": "to the exhibit. A network administrator is connecting a new host to the Registrar LAN. The host needs to communicate with remote networks. What IP address would be configured as the default gateway on the new host?", "ans": "packet forwarding*"}, {"title": "What property of ARP forces all Ethernet NICs to process an ARP request?", "ans": "path selection*"}, {"title": "What property of ARP causes a reply only to the source sending an ARP request?", "ans": "Explanation:"}, {"title": "What property of ARP causes the request to be flooded out all ports of a switch except for the port receiving the ARP request?", "ans": "The contents of NVRAM will change.*"}, {"title": "What property of ARP causes the NICs receiving an ARP request to pass the data portion of the Ethernet frame to the ARP process?", "ans": "Explanation:"}, {"title": "What property of ARP causes the NICs receiving an ARP request to pass the data portion of the Ethernet frame to the ARP process?", "ans": "The host cannot communicate with hosts in other networks.*"}, {"title": "", "ans": "Explanation:"}, {"title": "to the exhibit. A network administrator is connecting a new host to the Service LAN. The host needs to communicate with remote networks. What IP address would be configured as the default gateway on the new host?", "ans": "On large networks with low bandwidth, multiple ARP broadcasts could cause data communication delays.*"}, {"title": "", "ans": "Explanation:"}, {"title": "to the exhibit. A network administrator is connecting a new host to the Medical LAN. The host needs to communicate with remote networks. What IP address would be configured as the default gateway on the new host?", "ans": "R1: G0/0 and S0/0/0"}, {"title": "", "ans": "R2: G0/1 and S0/0/0**"}, {"title": "to the exhibit. A network administrator is connecting a new host to the Registrar LAN. The host needs to communicate with remote networks. What IP address would be configured as the default gateway on the new host?", "ans": "Explanation:"}, {"title": "", "ans": "Protocol*"}, {"title": "to the exhibit. A network administrator is connecting a new host to the Manager LAN. The host needs to communicate with remote networks. What IP address would be configured as the default gateway on the new host?", "ans": "differentiated services*"}, {"title": "", "ans": "source IPv4 address*"}, {"title": "to the exhibit. A network administrator is connecting a new host to the Store LAN. The host needs to communicate with remote networks. What IP address would be configured as the default gateway on the new host?", "ans": "header checksum*"}, {"title": "", "ans": "10.27.14.148*"}, {"title": "to the exhibit. A network administrator is connecting a new host to the Store LAN. The host needs to communicate with remote networks. What IP address would be configured as the default gateway on the new host?", "ans": "destination IPv4 address*"}, {"title": "", "ans": "TTL*"}, {"title": "to the exhibit. A network administrator is connecting a new host to the Service LAN. The host needs to communicate with remote networks. What IP address would be configured as the default gateway on the new host?", "ans": "Versión*"}, {"title": "", "ans": "Protocol*"}, {"title": "to the exhibit. A network administrator is connecting a new host to the Medical LAN. The host needs to communicate with remote networks. What IP address would be configured as the default gateway on the new host?", "ans": "Versión*"}, {"title": "Open the PT activity. Perform the tasks in the activity instructions and then ans the title.", "ans": "Entries in an ARP table are time-stamped and are purged after the timeout expires.*"}, {"title": "interfaces in each router are active and operational?", "ans": "A static IP-to-MAC address entry can be entered manually into an ARP table.*"}, {"title": "Which information is used by routers to forward a data packet toward its destination?", "ans": "A static IP-to-MAC address entry can be entered manually into an ARP table.*"}, {"title": "A computer has to send a packet to a destination host in the same LAN. How will the packet be sent?", "ans": "Local hosts learn the MAC address of the default gateway.*"}, {"title": "A router receives a packet from the Gigabit 0/0 interface and determines that the packet needs to be forwarded out the Gigabit 0/1 interface. What will the router do next?", "ans": "192.168.235.234*"}, {"title": "Which IPv4 address can a host use to ping the loopback interface?", "ans": "The destination MAC address FF-FF-FF-FF-FF-FF appears in the header of the Ethernet frame.*"}, {"title": "When a connectionless protocol is in use at a lower layer of the OSI model, how is missing data detected and retransmitted if necessary?", "ans": "The source MAC address appears in the header of the Ethernet frame.*"}, {"title": "What was the reason for the creation and implementation of IPv6?", "ans": "The destination MAC address FF-FF-FF-FF-FF-FF appears in the header of the Ethernet frame.*"}, {"title": "Which statement accurately describes a characteristic of IPv4?", "ans": "The type field 0x806 appears in the header of the Ethernet frame.*"}, {"title": "Which field in an IPv4 packet header will typically stay the same during its transmission?", "ans": "The type field 0x806 appears in the header of the Ethernet frame.*"}, {"title": "When a router receives a packet, what information must be examined in order for the packet to be forwarded to a remote destination?", "ans": "172.29.157.156*"}, {"title": "Which field in an IPv6 packet is used by the router to determine if a packet has expired and should be dropped?", "ans": "192.168.191.189*"}, {"title": "Which command can be used on a Windows host to display the routing table?", "ans": "192.168.225.223*"}, {"title": "What information is added during encapsulation at OSI Layer 3?", "ans": "10.118.62.196*"}, {"title": "How does the network layer use the MTU value?", "ans": "172.19.98.230*"}, {"title": "Which characteristic describes an IPv6 enhancement over IPv4?​", "ans": "172.20.132.13*"}, {"title": "When an IP packet is sent to a host on a remote network, what information is provided by ARP?", "ans": "192.168.167.166*"}, {"title": "How does the ARP process use an IP address?", "ans": "192.168.201.200*"}, {"title": "The ARP table in a switch maps which two types of address together?", "ans": "R1: G0/1 and S0/0/1"}, {"title": "What is one function of the ARP protocol?", "ans": "R2: G0/0 and S0/0/1**"}, {"title": "Which router component holds the routing table, ARP cache, and running configuration file?", "ans": "destination IP address*"}, {"title": "What type of information is contained in an ARP table?", "ans": "The packet will be sent directly to the destination host.*"}, {"title": "A PC is configured to obtain an IP address automatically from network 192.168.1.0/24. The network administrator issues the arp –a command and notices an entry of 192.168.1.255 ff-ff-ff-ff-ff-ff. Which statement describes this entry?", "ans": "create a new Layer 2 Ethernet frame to be sent to the destination*"}, {"title": "A cybersecurity analyst believes an attacker is spoofing the MAC address of the default gateway to perform a man-in-the-middle attack. Which command should the analyst use to view the MAC address a host is using to reach the default gateway?", "ans": "127.0.0.1*"}, {"title": "What is a function of ARP?", "ans": "Upper-layer connection-oriented protocols keep track of the data received and can request retransmission from the upper-level protocols on the sending host.*"}, {"title": "What is the purpose of ARP in an IPv4 network?", "ans": "to relieve IPv4 address depletion*"}, {"title": "Which action is taken by a Layer 2 switch when it receives a Layer 2 broadcast frame?", "ans": "IPv4 has a 32-bit address space.​*"}, {"title": "Which destination address is used in an ARP request frame?", "ans": "Destination Address*"}, {"title": "What addresses are mapped by ARP?", "ans": "destination IP address*"}, {"title": "What will a Layer 2 switch do when the destination MAC address of a received frame is not in the MAC table?", "ans": "Hop Limit*"}, {"title": "Which two ICMPv6 messages are used during the Ethernet MAC address resolution process? (Choose two.)", "ans": "netstat –r*"}, {"title": "A router boots and enters setup mode. What is the reason for this?", "ans": "source and destination IP address*"}, {"title": "Which command is used to encrypt all passwords in a router configuration file?", "ans": "The MTU is passed to the network layer by the data link layer.*"}, {"title": "Company policy requires using the most secure method to safeguard access to the privileged exec and configuration mode on the routers. The privileged exec password is trustknow1. Which of the following router commands achieves the goal of providing the highest level of security?", "ans": "The IPv6 header is simpler than the IPv4 header is, which improves packet handling.*"}, {"title": "What will be the response from the router after the command, “router(config)# hostname portsmouth” is entered?", "ans": "the MAC address of the router interface closest to the sending host*"}, {"title": "An administrator is configuring a new router to permit out-of-band management access. Which set of commands will allow the required login using a password of cisco?", "ans": "to determine the MAC address of a device on the same network*"}, {"title": "Which command can be used on a Cisco router to display all interfaces, the IPv4 address assigned, and the current status?", "ans": "Layer 3 address to a Layer 2 address*"}, {"title": "Which CLI mode allows users to access all device commands, such as those used for configuration, management, and troubleshooting?", "ans": "resolving an IPv4 address to a MAC address*"}, {"title": "What is the purpose of the startup configuration file on a Cisco router?", "ans": "RAM*"}, {"title": "Which characteristic describes the default gateway of a host computer?", "ans": "IP address to MAC address mappings*"}, {"title": "What is the purpose of the banner motd command?", "ans": "This is a static map entry.*"}, {"title": "A technician is configuring a router to allow for all forms of management access. As part of each different type of access, the technician is trying to type the command login. Which configuration mode should be entered to do this task?", "ans": "arp –a*"}, {"title": "What is stored in the NVRAM of a Cisco router?", "ans": "resolving IPv4 addresses to MAC addresses*"}, {"title": "Which statement regarding the service password-encryption command is true?", "ans": "to obtain a specific MAC address when an IP address is known*"}, {"title": "", "ans": "It sends the frame to all ports except the port on which it received the frame.*"}, {"title": "v7 Free Exam anss", "ans": "FFFF.FFFF.FFFF*"}, {"title": "", "ans": "destination MAC address to a destination IPv4 address*"}]